[
    {
        "suomi": {
            "name": "Eagle Engine",
            "dc": "Eagle engine on C++ 2D graafinen renderointimoottori Windowssille. Sitä voi käyttää helposti kaikenlaisten sovellusten sekä pelien tekemiseen, koska siinä on sisäänrakennettu GUI ja se tukee pythonia."
        },
        "english": {
            "name": "Eagle Engine",
            "dc": "Eagle Engine is a C++ 2D graphics rendering engine available for Windows. It can be used to make any sorts of desktop applications, including games. Use python and the GUI to create your applications."
        },

        "imagePath": "images/Eagle-engine.png",
        "url": "https://github.com/RaskiTech/Eagle",
        "color": "#74B9FF"
    },
    {
        "suomi": {
          "name": "Find a Function",
          "dc": "Tämä nettisivu löytää funktion, joka sopii datapisteisiisi. Se myös auttaa havainnollistamaan funktioita, ja sovittaa tiettyjen pisteiden läpi kulkevan parhaimman käyrän."
        },
        "english": {
            "name": "Find a Function",
            "dc": "This website is a function visualizer, as well as a function finder. Find a Function allows you to play with function, or know a functions that has some points in it."
        },

        "imagePath": "images/Find-a-Function.png",
        "url": "https://raskitech.github.io/Find-a-Function",
        "color": "#55EFC4"
    },
    {
        "suomi": {
            "name": "AI Seamless Lofi",
            "dc": "Tekoäly, joka osaa tehdä loputonta muuttuvaa lofi-musiikkia. Tekoäly treenattiin Tensorflown avulla ja muutettiin sitten javascript ystävälliseen muotoon."
        },
        "english": {
            "name": "AI Seamless Lofi",
            "dc": "AI that can make its own ever-changing Lofi music. The AI was trained with Tensorflow and then converted into a javascript friendly version."
        },

        "imagePath": "images/AI-Seamless-Lofi.png",
        "url": "https://raskitech.github.io/Seamless-Lofi/",
        "color": "#FF7675"
    },
    {
        "suomi": {
            "name": "Circuit Simulator",
            "dc": "Unityllä tehty Google play peli, jossa luodaan yhä monimutkaisempia virtapiirejä yhdistelemällä yksinkertaisempia virtapiirejä. Pelillä on tällä hetkellä yli 10k latausta."
        },
        "english": {
            "name": "Circuit Simulator",
            "dc": "A Google play game made with Unity, where you create advanced circuits from the ground up using simple logic gates. The game currently has over 10k downloads."
        },

        "imagePath": "images/Circuit-simulator.png",
        "url": "https://play.google.com/store/apps/details?id=com.RaskiTech.CircuitSimulator",
        "color": "#636E72"
    },
    {
        "suomi": {
            "name": "Fourier art",
            "dc": "Fourier'n sarjan avulla voi laskea mitkä kompleksivektorit approksimoivat parhaiten tiettyä käyrää. Tämä nettisivu visualisoi nämä vektorit mille tahansa käyrälle."
        },
        "english": {
            "name": "Fourier art",
            "dc": "Rotating complex vectors of different speeds and sizes can approximate any shape. This is \"Fourier series\" and it's visualized by this program in a clean way."
        },

        "imagePath": "images/Fourier-art.png",
        "url": "https://raskitech.github.io/Fourier-art/",
        "color": "#FF7675"
    }
]