[
    {
        "suomi": {
            "name": "Eagle engine",
            "dc": "Eagle engine on C++ 2D graafinen renderointimoottori Windowssille. Sitä voi käyttää kaikenlaisten sovellusten sekä pelien tekemiseen. Tee helposti applikaatiota pythonin, ja GUI:n avulla."
        },
        "english": {
            "name": "Eagle Engine",
            "dc": "Eagle Engine is a C++ 2D graphics rendering engine currently available for Windows. It can be used to make any sorts of desktop applications, including games. Use python and the GUI to create your applications."
        },

        "imagePath": "images/Eagle-engine.png",
        "url": "https://github.com/RaskiTech/Eagle",
        "color": "#74B9FF"
    },
    {
        "suomi": {
          "name": "Find a Function",
          "dc": "Find a Function löytää funktion, joka sopii datapisteisiisi. Se myös auttaa havainnollistamaan funktioita, ja sovittaa tiettyjen pisteiden läpi kulkevan parhaimman käyrän."
        },
        "english": {
            "name": "Find a Function",
            "dc": "Find a Function is a function visualizer, as well as a function finder. Find a Function allows you to play with function, or know a functions that has some points in it."
        },

        "imagePath": "images/Find-a-Function.png",
        "url": "https://raskitech.github.io/Find-a-Function",
        "color": "#55EFC4"
    },
    {
        "suomi": {
            "name": "AI Composer",
            "dc": "Tekoäly, joka osaa tehdä omaa midi-musiikkia. Ohjelmalla voi sekä soittaa ja muokata tätä musiikkia että ladata sen midinä tai wavena. Tehty Eagle enginellä."
        },
        "english": {
            "name": "AI Composer",
            "dc": "AI that can make its own music. With this program you can mutate and play the music as well as download it as midi or as wav. Made using the Eagle Engine."
        },

        "imagePath": "images/AI-Composer.png",
        "url": "https://github.com/RaskiTech/AI-Composer",
        "color": "#FF7675"
    },
    {
        "suomi": {
            "name": "Circuit Simulator",
            "dc": "Google play peli, jossa luodaan yhä monimutkaisempia virtapiirejä yhdistelemällä yksinkertaisempia virtapiirejä."
        },
        "english": {
            "name": "Circuit Simulator",
            "dc": "A Google play game, where you create advanced circuits from the ground up using simple logic gates."
        },

        "imagePath": "images/Circuit-simulator.png",
        "url": "https://play.google.com/store/apps/details?id=com.RaskiTech.CircuitSimulator",
        "color": "#636E72"
    },
    {
        "suomi": {
            "name": "Fourier art",
            "dc": "Eri kokoiset ja eri nopeuksilla pyörivät kompleksivektorit voivat arvioida mitä tahansa käyrää. Tätä kutsutaan Fourier`n sarjaksi, jonka tämä ohjelma visualisoi siististi."
        },
        "english": {
            "name": "Fourier art",
            "dc": "Rotating complex vectors of different speeds and sizes can approximate any shape. This is \"Fourier series\" and it's visualized by this program in a clean way."
        },

        "imagePath": "images/Fourier-art.png",
        "url": "https://raskitech.github.io/Fourier-art/",
        "color": "#FF7675"
    },
    {
        "suomi": {
            "name": "Raytracer",
            "dc": "Säteenjäljitysohjelma tehty matkimaan valon pomppimista oikean maailman mukaisesti."
        },
        "english": {
            "name": "Raytracer",
            "dc": "A raytracer made with c++ made to mimic how light bounces in the real world."
        },
        
        "imagePath": "images/Raytracer.png",
        "url": "https://github.com/RaskiTech/Raytracer",
        "color": "#55EFC4"
    },
    {
        "suomi": {
            "name": "Sudoku solver",
            "dc": "Applikaatio, joka ratkaisee valitsemasi Sudoku-laudan käyttäen paluualgorymiä. Sisältää graaffisen käyttöliittymän, johon luvut voi laittaa."
        },
        "english": {
            "name": "Sudoku solver",
            "dc": "An application that solves your chosen Sudoku board using the backtracing algorithm. Includes a graphical user interface where the numbers can be set."
        },

        "imagePath": "images/sudoku.png",
        "url": "https://github.com/RaskiTech/Sudoku-Solver",
        "color": "#DFE6E9"
    },
    {
        "suomi": {
            "name": "Shifting squares",
            "dc": "Google play puzzle peli, jossa tehdään aloitusasetelma ja annetaan pelin simuloida itsensä."
        },
        "english": {
            "name": "Shifting squares",
            "dc": "A game of life inspired puzzle game on Google play. In the game you setup a starting condition and let the game play out."
        },

        "imagePath": "images/Shifting-squares.png",
        "url": "https://play.google.com/store/apps/details?id=com.RaskiTech.ShiftingSquares",
        "color": "#74B9FF"
    },
    {
        "suomi": {
            "name": "Tämä nettisivu",
            "dc": "Ja viimeiseksi, tämä nettisivu kaikkien animaatioiden ja visuaalien kera."
        },
        "english": {
            "name": "This website",
            "dc": "And lastly, this website with all the animations and visuals."
        },

        "imagePath": "logo512.png",
        "color": "#FAB1A0"
    }
]
